export const menuItems = [
    {
        title: 'Главная',
        link: '/',
        active: false
    },
    {
        title: 'Наши работы',
        link: '/works',
        active: false
    },
    {
        title: 'Процесс',
        link: '/process',
        active: false
    },
    {
        title: 'О нас',
        link: '/about',
        active: false
    },
    {
        title: 'Контакты',
        link: '/contacts',
        active: false
    },
]

export const heroBanner = {
    title: 'Студия декора',
    subtitle: 'Для Тебя',
    buttons: [
        {
            text: 'Наши работы',
            variant: 'secondary',
            size: 'large'
        },
        {
            text: 'Связаться с нами',
            variant: 'primary',
            size: 'large'
        }
    ]
}

export const servicesSection = {
    title: 'Наши услуги',
    description: 'Наши услуги помогут вам создать уникальное и запоминающееся мероприятие. Мы знаем как превратить ваш праздник в настоящее произведение искусства.'
}

export const services = [
    {
        img: '/src/assets/images/our-services/design.png',
        title: 'Дизайн',
        description: 'В нашем агентстве команда дизайнеров создает уникальные и стильные проекты для мероприятий. Мы верим, что качественный декор - это не только визуальная красота, но и создание атмосферы, которая погружает гостей в праздники и оставляет яркие впечатления.'
    },
    {
        img: '/src/assets/images/our-services/project.png',
        title: 'Проектирование и создание объектов',
        description: 'Мы специализируемся на разработке и изготовлении центральных элементов, которые задают тон всему празднику и становятся главными героями фотографий.'
    },
    {
        img: '/src/assets/images/our-services/styling.png',
        title: 'Детальная стилизация и координация',
        description: 'Волшебство кроется в мелочах. Мы продумываем финальные штрихи, которые связывают всё пространство воедино и усиливают впечатления гостей. Наша команда работает на площадке, чтобы всё выглядело идеально.'
    }
]

export const whyChooseUsBanner = {
    title: 'Почему выбирают нас?',
    description: 'Вы получаете не просто красивый декор, а идеальный праздник. Наш опыт и внимание к мелочам создают безупречную атмосферу, в которой всё продумано за вас.'
}

export const features = [
    {
        title: 'Экспертность',
        description: 'Команда «Для тебя» — это профессионалы с безупречным вкусом и глубоким знанием индустрии. Мы живём в мире событий и трендов, чтобы предлагать вам только самые свежие, эффектные и технологичные решения для декора.',
        icon: '/src/assets/images/whu-choose-us/1.png'
    },
    {
        title: 'Клиентоориентированный подход',
        description: 'Ваше видение праздника — наш главный ориентир. Мы внимательно слушаем, чтобы каждая деталь декора отражала именно вашу историю. Ваши эмоции — наша лучшая награда.',
        icon: '/src/assets/images/whu-choose-us/2.png'
    },
    {
        title: 'Решения, ориентированные на результат',
        description: 'Для нас результат — это ваши эмоции и полное удовлетворение от праздника. Мы соединяем креативную концепцию и практические навыки организации, чтобы создать атмосферу, которая восхищает и выделяет ваше событие среди других.',
        icon: '/src/assets/images/whu-choose-us/3.png'
    },
    {
        title: 'Партнерство',
        description: 'Для нас важно, чтобы после первого праздника вы возвращались к нам снова. Мы становимся вашими личными декораторами, которые знают ваш вкус и помогают развивать стиль ваших событий год за годом, обеспечивая неизменно высокий уровень и актуальные решения.',
        icon: '/src/assets/images/whu-choose-us/4.png'
    }
]

export const faqSection = {
    title: 'Часто Задаваемые Вопросы',
    description: 'Остались ещё вопросы? Свяжитесь с нашей командой!'
}

export const faqItems = [
    {
        number: '01',
        title: 'Какие услуги предоставляет Ваше декор-агенство?',
        content: 'Декор-агентство «Для тебя» — это команда, которая превращает ваше мероприятие в незабываемое событие с безупречной атмосферой. Мы создаём художественное пространство, которое отражает вашу идею и удивляет гостей.',
        open: true
    },
    {
        number: '02',
        title: 'Можно ли реализовать проект силами ваших проверенных подрядчиков?',
        content: 'Да, и это один из наших главных плюсов. Мы сотрудничаем с проверенными бригадами и мастерами, которые знают наши стандарты качества и работают по нашим чертежам.',
        open: false
    },
    {
        number: '03',
        title: 'Есть ли у вас готовые пакеты услуг и как понять, что входит в стоимость?',
        content: 'Мы не работаем по шаблонным пакетам, потому что каждый проект уникален. После знакомства мы подготовим для вас персональное предложение с детализированной сметой. Вы будете точно знать, за что платите на каждом этапе: концепция, 3D-визуализации, рабочие чертежи, подбор материалов и авторский надзор. Прозрачность — наш главный принцип.',
        open: false
    },
    {
        number: '04',
        title: 'Как происходит взаимодействие? Мне нужно будет постоянно контролировать процесс?',
        content: 'Нет, ваша ключевая задача — согласовывать идеи и решения на основных этапах. Мы назначаем персонального менеджера проекта, который координирует все процессы: от замеров и подбора материалов до авторского надзора за строителями. Вы получаете удобный чат и регулярные отчёты, оставаясь в курсе событий без необходимости ежедневного присутствия.',
        open: false
    }
]

export const contactSection = {
    title: 'Спасибо за Ваш интерес к нашему Декор-агенству',
    description: 'Мы будем рады услышать ваши идеи и обсудить как создать неповторимую атмосферу вашего события. Выберите удобный способ связаться с нами:',
    buttonText: 'Начать проект'
}

export const eventTypes = [
    {
        label: 'Свадьба',
        value: 'wedding'
    },
    {
        label: 'День рождение',
        value: 'birthday'
    },
    {
        label: 'Корпоратив',
        value: 'corporate'
    },
    {
        label: 'Другое',
        value: 'other'
    }
]

export const footerData = {
    logo: "для тебя",
    navLinks: [
        {
            id: 1,
            title: "Главная",
            link: "/"
        },
        {
            id: 2,
            title: "Наши работы",
            link: "/works"
        },
        {
            id: 3,
            title: "Процесс",
            link: "/process"
        },
        {
            id: 4,
            title: "О нас",
            link: "/about"
        },
        {
            id: 5,
            title: "Контакты",
            link: "/contacts"
        },
    ],
    email: "studiya.diyatebya@mail.ru",
    phone: "+7(928)279-78-72",
    location: "Ростов-на-Дону",
    termsText: "Договор оферты",
    termsLink: "#",
    privacyText: "Согласие на обработку персональных данных",
    privacyLink: "#",
    copyright: "© 2025 ForYou. All rights reserved."
};