export const menuItems = [
    {
        title: 'Главная',
        link: '/',
        active: false
    },
    {
        title: 'Наши работы',
        link: '/works',
        active: false
    },
    {
        title: 'Процесс',
        link: '/process',
        active: false
    },
    {
        title: 'О нас',
        link: '/about',
        active: false
    },
    {
        title: 'Контакты',
        link: '/contacts',
        active: false
    },
]

export const heroBanner = {
    title: 'Студия декора',
    subtitle: 'Для Тебя',
    buttons: [
        {
            text: 'Наши работы',
            variant: 'secondary',
            size: 'large'
        },
        {
            text: 'Связаться с нами',
            variant: 'primary',
            size: 'large'
        }
    ]
}

export const servicesSection = {
    title: 'Наши услуги',
    description: 'Наши услуги помогут вам создать уникальное и запоминающееся мероприятие. Мы знаем как превратить ваш праздник в настоящее произведение искусства.'
}

export const services = [
    {
        img: '/src/assets/images/our-services/design.png',
        title: 'Дизайн',
        description: 'В нашей студии декора команда декораторов создаёт уникальные и стильные проекты для мероприятий. Мы верим, что качественный декор - это не только визуальная красота, но и создание атмосферы, которая погружает гостей в праздник.'
    },
    {
        img: '/src/assets/images/our-services/project.png',
        title: 'Проектирование и создание объектов',
        description: 'Мы разрабатываем и создаём ключевые элементы оформления, которые формируют атмосферу события, задают визуальный стиль и становятся яркими акцентами пространства. Именно такие объекты притягивают внимание гостей, задают настроение всему празднику.'
    },
    {
        img: '/src/assets/images/our-services/styling.png',
        title: 'Детальная стилизация и координация',
        description: 'Волшебство кроется в мелочах. Мы продумываем каждую деталь, которая объединяет всё пространство в единую концепцию и усиливает впечатление гостей. Именно детали создают ту самую атмосферу, которая запоминается гостям.'
    }
]

export const whyChooseUsBanner = {
    title: 'Почему выбирают нас?',
    description: 'Вы получаете не просто красивый декор, а идеальный праздник. Наш опыт и внимание к мелочам создают безупречную атмосферу, в которой всё продумано за вас.'
}

export const features = [
    {
        title: 'Экспертность',
        description: 'Студия декора и флористики «Для тебя» — это команда профессионалов с тонким вкусом, большим опытом и глубоким пониманием индустрии. Мы следим за тенденциями, живём в мире событий и эстетики, чтобы предлагать современные, эффектные и продуманные решения для оформления самых разных мероприятий',
        icon: '/src/assets/images/whu-choose-us/1.png'
    },
    {
        title: 'Клиентоориентированный подход',
        description: 'Ваше видение праздника — наш главный ориентир. Мы внимательно прислушиваемся к вашим пожеланиям, чтобы каждая деталь декора отражала характер события, вашу историю и настроение. Для нас особенно ценно видеть ваши искренние эмоции, ведь именно они становятся лучшим подтверждением того, что оформление получилось по-настоящему про вас.',
        icon: '/src/assets/images/whu-choose-us/2.png'
    },
    {
        title: 'Решения, ориентированные на результат',
        description: 'Для нас важно не просто оформить одно событие, а стать вашей постоянной командой в создании красивых и запоминающихся праздников. Мы стремимся к тому, чтобы после первого проекта вы захотели возвращаться к нам снова. И мы стали вашими личными декораторами, которые знают ваш вкус.',
        icon: '/src/assets/images/whu-choose-us/3.png'
    },
    {
        title: 'Партнерство',
        description: 'Для нас важно, чтобы после первого праздника вы возвращались к нам снова. Мы становимся вашими личными декораторами, которые знают ваш вкус и помогают развивать стиль ваших событий год за годом, обеспечивая неизменно высокий уровень и актуальные решения.',
        icon: '/src/assets/images/whu-choose-us/4.png'
    }
]

export const faqSection = {
    title: 'Часто Задаваемые Вопросы',
    description: 'Остались ещё вопросы? Свяжитесь с нашей командой!'
}

export const faqItems = [
    {
        number: '01',
        title: 'Какие услуги предоставляет Ваша декор-студия?',
        content: 'Студия декора и флористики «Для тебя» — это команда, которая превращает ваше мероприятие в незабываемое событие с безупречной атмосферой. Мы создаём художественное пространство, которое отражает вашу идею и удивляет гостей.',
        open: true
    },
    {
        number: '02',
        title: 'Можно ли реализовать проект силами ваших проверенных подрядчиков?',
        content: 'Да, и это один из наших главных плюсов. Мы сотрудничаем с проверенными бригадами и мастерами, которые знают наши стандарты качества и работают по нашим чертежам.',
        open: false
    },
    {
        number: '03',
        title: 'Есть ли у вас готовые пакеты услуг и как понять, что входит в стоимость?',
        content: 'Мы не работаем по шаблонным пакетам, потому что каждый проект уникален. После знакомства мы подготовим для вас персональное предложение с детализированной сметой. Вы будете точно знать, за что платите на каждом этапе: концепция, 3D-визуализации, рабочие чертежи, подбор материалов и авторский надзор. Прозрачность — наш главный принцип.',
        open: false
    },
    {
        number: '04',
        title: 'Как происходит взаимодействие? Мне нужно будет постоянно контролировать процесс?',
        content: 'Нет, ваша ключевая задача — согласовывать идеи и решения на основных этапах. Мы назначаем персонального менеджера проекта, который координирует все процессы: от замеров и подбора материалов до авторского надзора за строителями. Вы получаете удобный чат и регулярные отчёты, оставаясь в курсе событий без необходимости ежедневного присутствия.',
        open: false
    }
]

export const contactSection = {
    title: 'Спасибо за Ваш интерес к нашей Декор-студии',
    description: 'Мы будем рады услышать ваши идеи и обсудить как создать неповторимую атмосферу вашего события. Выберите удобный способ связаться с нами:',
    buttonText: 'Начать проект'
}

export const eventTypes = [
    {
        label: 'Свадьба',
        value: 'wedding'
    },
    {
        label: 'День рождение',
        value: 'birthday'
    },
    {
        label: 'Корпоратив',
        value: 'corporate'
    },
    {
        label: 'Другое',
        value: 'other'
    }
]

export const footerData = {
    logo: "для тебя",
    navLinks: [
        {
            id: 1,
            title: "Главная",
            link: "/"
        },
        {
            id: 2,
            title: "Наши работы",
            link: "/works"
        },
        {
            id: 3,
            title: "Процесс",
            link: "/process"
        },
        {
            id: 4,
            title: "О нас",
            link: "/about"
        },
        {
            id: 5,
            title: "Контакты",
            link: "/contacts"
        },
    ],
    email: "studiya_dlyatebya@mail.ru",
    phone: "+7(928)279-78-72",
    location: "Ростов-на-Дону",
    termsText: "Пользовательское соглашение",
    termsLink: "/user-agreement.pdf",
    privacyText: "Согласие на обработку персональных данных",
    privacyLink: "/soglasie.pdf",
    copyright: "© 2025 ForYou. All rights reserved."
};